In [1]:
import pandas as ps

In [2]:
data = ps.read_csv(r'D:\gold_prices.csv')
data

,Date,gold_oz_usd_price,gold_kg_usd_price,gold_oz_gbp_price,gold_kg_gbp_price,gold_oz_eur_price,gold_kg_eur_price
0,1968-01-02 09:00:00+00:00,35.18,1131.06,14.64,470.69,NaN,NaN
1,1968-01-30 09:00:00+00:00,35.19,1131.38,14.59,469.08,NaN,NaN
2,1968-02-01 09:00:00+00:00,35.20,1131.70,14.59,469.08,NaN,NaN
3,1968-03-01 09:00:00+00:00,35.20,1131.70,14.66,471.33,NaN,NaN
4,1968-04-01 09:00:00+00:00,38.00,1221.73,15.81,508.30,NaN,NaN
...,...,...,...,...,...,...,...
1176,2024-07-01 00:00:29+00:00,2326.44,74796.67,1839.38,59137.35,2167.17,69676.03
1177,2024-07-17 14:00:27+00:00,2485.75,79918.60,NaN,NaN,NaN,NaN
1178,2024-07-30 00:00:22+00:00,2384.17,76652.73,1854.21,59614.15,2203.90,70856.93
1179,2024-07-30 18:58:14+00:00,NaN,NaN,NaN,NaN,2226.60,71586.75
1180,2024-07-30 19:00:27+00:00,2407.03,77387.70,1875.67,60304.10,NaN,NaN

In [3]:
data.head(5)

,Date,gold_oz_usd_price,gold_kg_usd_price,gold_oz_gbp_price,gold_kg_gbp_price,gold_oz_eur_price,gold_kg_eur_price
0,1968-01-02 09:00:00+00:00,35.18,1131.06,14.64,470.69,NaN,NaN
1,1968-01-30 09:00:00+00:00,35.19,1131.38,14.59,469.08,NaN,NaN
2,1968-02-01 09:00:00+00:00,35.20,1131.70,14.59,469.08,NaN,NaN
3,1968-03-01 09:00:00+00:00,35.20,1131.70,14.66,471.33,NaN,NaN
4,1968-04-01 09:00:00+00:00,38.00,1221.73,15.81,508.30,NaN,NaN

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1181 entries, 0 to 1180
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Date               1181 non-null   object
 1   gold_oz_usd_price  1176 non-null   float64
 2   gold_kg_usd_price  1170 non-null   float64
 3   gold_oz_gbp_price  1170 non-null   float64
 4   gold_kg_gbp_price  1168 non-null   float64
 5   gold_oz_eur_price  543 non-null    float64
 6   gold_kg_eur_price  543 non-null    float64
dtypes: float64(6), object(1)
memory usage: 64.7+ KB

In [5]:
data.isnull().sum()

Date                   0
gold_oz_usd_price      5
gold_kg_usd_price     11
gold_oz_gbp_price     11
gold_kg_gbp_price     13
gold_oz_eur_price    638
gold_kg_eur_price    638
dtype: int64

In [7]:
data.drop(columns = ['gold_oz_eur_price' , 'gold_kg_eur_price'] , inplace = True)
data

,Date,gold_oz_usd_price,gold_kg_usd_price,gold_oz_gbp_price,gold_kg_gbp_price
0,1968-01-02 09:00:00+00:00,35.18,1131.06,14.64,470.69
1,1968-01-30 09:00:00+00:00,35.19,1131.38,14.59,469.08
2,1968-02-01 09:00:00+00:00,35.20,1131.70,14.59,469.08
3,1968-03-01 09:00:00+00:00,35.20,1131.70,14.66,471.33
4,1968-04-01 09:00:00+00:00,38.00,1221.73,15.81,508.30
...,...,...,...,...,...
1176,2024-07-01 00:00:29+00:00,2326.44,74796.67,1839.38,59137.35
1177,2024-07-17 14:00:27+00:00,2485.75,79918.60,NaN,NaN
1178,2024-07-30 00:00:22+00:00,2384.17,76652.73,1854.21,59614.15
1179,2024-07-30 18:58:14+00:00,NaN,NaN,NaN,NaN
1180,2024-07-30 19:00:27+00:00,2407.03,77387.70,1875.67,60304.10

In [8]:
data

,Date,gold_oz_usd_price,gold_kg_usd_price,gold_oz_gbp_price,gold_kg_gbp_price
0,1968-01-02 09:00:00+00:00,35.18,1131.06,14.64,470.69
1,1968-01-30 09:00:00+00:00,35.19,1131.38,14.59,469.08
2,1968-02-01 09:00:00+00:00,35.20,1131.70,14.59,469.08
3,1968-03-01 09:00:00+00:00,35.20,1131.70,14.66,471.33
4,1968-04-01 09:00:00+00:00,38.00,1221.73,15.81,508.30
...,...,...,...,...,...
1176,2024-07-01 00:00:29+00:00,2326.44,74796.67,1839.38,59137.35
1177,2024-07-17 14:00:27+00:00,2485.75,79918.60,NaN,NaN
1178,2024-07-30 00:00:22+00:00,2384.17,76652.73,1854.21,59614.15
1179,2024-07-30 18:58:14+00:00,NaN,NaN,NaN,NaN
1180,2024-07-30 19:00:27+00:00,2407.03,77387.70,1875.67,60304.10

In [9]:
data['gold_oz_usd_price'].fillna(method = 'ffill' , inplace = True)
data

C:\Users\FAIZ\AppData\Local\Temp\ipykernel_26764\2757100681.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data['gold_oz_usd_price'].fillna(method = 'ffill' , inplace = True)
C:\Users\FAIZ\AppData\Local\Temp\ipykernel_26764\2757100681.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data['gold_oz_usd_price'].fillna(method = 'ffill' , inplace = True)

,Date,gold_oz_usd_price,gold_kg_usd_price,gold_oz_gbp_price,gold_kg_gbp_price
0,1968-01-02 09:00:00+00:00,35.18,1131.06,14.64,470.69
1,1968-01-30 09:00:00+00:00,35.19,1131.38,14.59,469.08
2,1968-02-01 09:00:00+00:00,35.20,1131.70,14.59,469.08
3,1968-03-01 09:00:00+00:00,35.20,1131.70,14.66,471.33
4,1968-04-01 09:00:00+00:00,38.00,1221.73,15.81,508.30
...,...,...,...,...,...
1176,2024-07-01 00:00:29+00:00,2326.44,74796.67,1839.38,59137.35
1177,2024-07-17 14:00:27+00:00,2485.75,79918.60,NaN,NaN
1178,2024-07-30 00:00:22+00:00,2384.17,76652.73,1854.21,59614.15
1179,2024-07-30 18:58:14+00:00,2384.17,NaN,NaN,NaN
1180,2024-07-30 19:00:27+00:00,2407.03,77387.70,1875.67,60304.10

In [10]:
data['gold_kg_usd_price'].fillna(method = 'ffill' , inplace = True)
data

C:\Users\FAIZ\AppData\Local\Temp\ipykernel_26764\1815332195.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data['gold_kg_usd_price'].fillna(method = 'ffill' , inplace = True)
C:\Users\FAIZ\AppData\Local\Temp\ipykernel_26764\1815332195.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data['gold_kg_usd_price'].fillna(method = 'ffill' , inplace = True)

,Date,gold_oz_usd_price,gold_kg_usd_price,gold_oz_gbp_price,gold_kg_gbp_price
0,1968-01-02 09:00:00+00:00,35.18,1131.06,14.64,470.69
1,1968-01-30 09:00:00+00:00,35.19,1131.38,14.59,469.08
2,1968-02-01 09:00:00+00:00,35.20,1131.70,14.59,469.08
3,1968-03-01 09:00:00+00:00,35.20,1131.70,14.66,471.33
4,1968-04-01 09:00:00+00:00,38.00,1221.73,15.81,508.30
...,...,...,...,...,...
1176,2024-07-01 00:00:29+00:00,2326.44,74796.67,1839.38,59137.35
1177,2024-07-17 14:00:27+00:00,2485.75,79918.60,NaN,NaN
1178,2024-07-30 00:00:22+00:00,2384.17,76652.73,1854.21,59614.15
1179,2024-07-30 18:58:14+00:00,2384.17,76652.73,NaN,NaN
1180,2024-07-30 19:00:27+00:00,2407.03,77387.70,1875.67,60304.10

In [11]:
data.fillna(method = 'ffill' , inplace = True)
data

C:\Users\FAIZ\AppData\Local\Temp\ipykernel_26764\1201272847.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data.fillna(method = 'ffill' , inplace = True)

,Date,gold_oz_usd_price,gold_kg_usd_price,gold_oz_gbp_price,gold_kg_gbp_price
0,1968-01-02 09:00:00+00:00,35.18,1131.06,14.64,470.69
1,1968-01-30 09:00:00+00:00,35.19,1131.38,14.59,469.08
2,1968-02-01 09:00:00+00:00,35.20,1131.70,14.59,469.08
3,1968-03-01 09:00:00+00:00,35.20,1131.70,14.66,471.33
4,1968-04-01 09:00:00+00:00,38.00,1221.73,15.81,508.30
...,...,...,...,...,...
1176,2024-07-01 00:00:29+00:00,2326.44,74796.67,1839.38,59137.35
1177,2024-07-17 14:00:27+00:00,2485.75,79918.60,1839.38,59137.35
1178,2024-07-30 00:00:22+00:00,2384.17,76652.73,1854.21,59614.15
1179,2024-07-30 18:58:14+00:00,2384.17,76652.73,1854.21,59614.15
1180,2024-07-30 19:00:27+00:00,2407.03,77387.70,1875.67,60304.10

In [12]:
data.isnull().sum()

Date                 0
gold_oz_usd_price    0
gold_kg_usd_price    0
gold_oz_gbp_price    0
gold_kg_gbp_price    0
dtype: int64